test_RA/src/DataProcessors/Telegram_ОбработкаОтладки/Telegram_ОбработкаОтладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Telegram_ОбработкаОтладки</name>
</mdclass:DataProcessor>

test_RA/src/InformationRegisters/Telegram_Пользователи/Telegram_Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Telegram_Пользователи</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяПользователяТелеграм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_Пользователя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

test_RA/src/DataProcessors/Telegram_ОбработкаОтладки/Forms/Форма/Module.bsl
&НаСервере
Процедура ПрочитатьСообщениеНаСервере()
	Telegram_Сервер.ПрочитатьСообщенияПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСообщение(Команда)
	ПрочитатьСообщениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапускОбработчикаОжиданий(Команда)
	 ПодключитьОбработчикОжидания("ОбработчикОжиданияПроцедура",2);
КонецПроцедуры


&НаКлиенте
Процедура ОбработчикОжиданияПроцедура()
	Telegram_Сервер.ПрочитатьСообщенияПользователя();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеПользователямНаСервере()
	    Запрос = Новый Запрос;
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	Telegram_Пользователи.ИмяПользователяТелеграм КАК ИмяПользователяТелеграм,
	                   |	Telegram_Пользователи.ID_Пользователя КАК ID_Пользователя,
	                   |	Telegram_Пользователи.Пользователь КАК Пользователь
	                   |ИЗ
	                   |	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи";
	    
	    ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	    Пока ВыборкаЗапроса.Следующий() Цикл
	         Telegram_Сервер.ОтправитьСообщениеПользователюНаСогласование(ВыборкаЗапроса.ID_Пользователя,ТекстСогласования);
	    	
	    КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеПользователям(Команда)
	ОтправитьСообщениеПользователямНаСервере();
КонецПроцедуры
